* Makarevich Vladislav
// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

//  Console.Write("Введите первое число: ");
//  int n1 = Convert.ToInt32(Console.ReadLine());
//  Console.Write("Введите второе число: ");
//  int n2 = Convert.ToInt32(Console.ReadLine());

//     if(n1 < n2)
//         Console.WriteLine("min " + n1 + " max " + n2);

//     else
//        Console.WriteLine("min " + n2 + " max " + n1);

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// Console.Write("Введите первое число: ");
// int n1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int n2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите третье число: ");
// int n3 = Convert.ToInt32(Console.ReadLine());

//     if(n1 > n2 && n1 > n3)
//         Console.WriteLine("max " + n1);
    
//     if(n2 > n1 && n2 > n3)
//         Console.WriteLine("max " + n2);

//     if(n3 > n1 && n3 > n2)
//         Console.WriteLine("max " + n3);

// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// Console.Write("Введите число: ");
// int n = Convert.ToInt32(Console.ReadLine());

//     if(n % 2 == 0)
//         Console.WriteLine("Yes");
    
//     else
//         Console.WriteLine("No");

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// Console.Write("Введите число: ");
// int n = Convert.ToInt32(Console.ReadLine());

// int current = 2;
//        while (current < n)
//        {
//         Console.WriteLine(current);
//         current += 2;
//        }

// Задача 8: Вариант 2:

// Console.Write("Введите число: ");
// int n = Convert.ToInt32(Console.ReadLine());

// int current = 1;
//        while (current < n)
//        {
//         Console.WriteLine(current + 1);
//         current += 2;
//        }
